In [ ]:
import pandas as pd

In [ ]:
!pip install fastai -Uqq

     |████████████████████████████████| 194kB 5.8MB/s
     |████████████████████████████████| 61kB 7.5MB/s

In [ ]:
from fastai.vision.all import *

In [ ]:
path = untar_data(URLs.PASCAL_2007)

In [ ]:
!dir path

dir: cannot access 'path': No such file or directory

In [ ]:
df = pd.read_csv(path/'train.csv')

In [ ]:
df.head()

        fname        labels  is_valid
0  000005.jpg         chair      True
1  000007.jpg           car      True
2  000009.jpg  horse person      True
3  000012.jpg           car     False
4  000016.jpg       bicycle      True

In [ ]:
df.iloc[:,0] # first column

0       000005.jpg
1       000007.jpg
2       000009.jpg
3       000012.jpg
4       000016.jpg
           ...
5006    009954.jpg
5007    009955.jpg
5008    009958.jpg
5009    009959.jpg
5010    009961.jpg
Name: fname, Length: 5011, dtype: object

In [ ]:
df.iloc[0,:] # first row

fname       000005.jpg
labels           chair
is_valid          True
Name: 0, dtype: object

In [ ]:
df['fname'] # using column name as index

0       000005.jpg
1       000007.jpg
2       000009.jpg
3       000012.jpg
4       000016.jpg
           ...
5006    009954.jpg
5007    009955.jpg
5008    009958.jpg
5009    009959.jpg
5010    009961.jpg
Name: fname, Length: 5011, dtype: object

In [ ]:
tmp_df = pd.DataFrame({'a':[1,2], 'b':[3,4]}) # creating a dataframe
tmp_df

   a  b
0  1  3
1  2  4

In [ ]:
tmp_df['c'] = tmp_df['a']+ tmp_df['b'] # creating a column
tmp_df

   a  b  c
0  1  3  4
1  2  4  6